{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "specified-slide",
   "metadata": {},
   "source": [
    "# Finding potential fragment merges with the Fragment Network\n",
    "\n",
    "This notebook illustrates how to use the Fragment Network to find purchasable molecules that\n",
    "combine parts of two fragments.\n",
    "\n",
    "For information about the Fragment Network see:\n",
    "* [doi:10.1021/acs.jmedchem.7b00809](https://pubs.acs.org/doi/10.1021/acs.jmedchem.7b00809)\n",
    "* https://fragnet.informaticsmatters.com/\n",
    "\n",
    "The assumption is that you have 2 fragment screening hits that are partly overlapping in space.\n",
    "You want to identify purchasable molecules that might be *best of both worlds* in forming interactions\n",
    "from both fragments.\n",
    "\n",
    "We use the term \"synthon\" to mean a fragment of a molecule in the context of the Fragment Network.\n",
    "We use this term rather than fragment to avoid confusion with the use of that name in fragment screening. \n",
    "\n",
    "The approach is to:\n",
    "* Identify the synthons of fragment B that you want to graft onto fragment A \n",
    "* Start from fragment A and optionally remove one synthon (mols1)\n",
    "* For those molecules optionally add one synthon of any type (mols2)\n",
    "* For each synthon from fragment B add it to each of mols2 (mols3)\n",
    "\n",
    "Where we state remove a synthon we mean find molecules in the Fragment Network that is a direct child of the source molecule.\n",
    "Where we state add a synthon we mean find molecules in the Fragment Network that is a direct parent of the source molecule.\n",
    "\n",
    "The result is a set of molecules derived from fragment A, possibly missing one synthon, having one synthon from fragment B added and possibly having one extra synthon of any type added.\n",
    "\n",
    "One a small subset of these will be able to take up favourable conformations that are compatible with forming the relevent interactions formed by fragments A and B. This has to be checked using subsequent 3D techniques. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "photographic-dating",
   "metadata": {},
   "source": [
    "## Usage\n",
    "\n",
    "To use this you must have a Fragment Network Neo4j database running on your machine.\n",
    "\n",
    "Typically do this with one of our [test containers](https://github.com/InformaticsMatters/docker-fragnet-test)\n",
    "of by using `kubect port-forward ...` to access a real database running in K8S. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "periodic-beverage",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "unusual-hundred",
   "metadata": {},
   "outputs": [],
   "source": [
    "# prompt for the database password\n",
    "import getpass\n",
    "try:\n",
    "    password\n",
    "except NameError:\n",
    "    password = getpass.getpass()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "professional-establishment",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "cooperative-treat",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Node id=176921298 labels=frozenset({'CanSmi', 'Mol', 'F2', 'V_REAL'}) properties={'osmiles': 'CC1CCC(C(O)CC2CCC3CCCCC23)CC1', 'chac': 15, 'hac': 19, 'smiles': 'CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1', 'cmpd_ids': ['REAL:Z1400780201']}>\n"
     ]
    }
   ],
   "source": [
    "# simple example of a finding a molecule using its SMILES\n",
    "def find_molecule_node(tx, smiles):\n",
    "    for record in tx.run('MATCH (m:F2 {smiles: $smiles}) RETURN m', smiles=smiles):\n",
    "        node = record['m']\n",
    "        return node\n",
    "    \n",
    "with driver.session() as session:\n",
    "    mol = session.read_transaction(find_molecule_node, 'CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1')\n",
    "    print(mol)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "mental-jenny",
   "metadata": {},
   "source": [
    "## Parameters"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "familiar-statement",
   "metadata": {},
   "outputs": [],
   "source": [
    "# until we have proper test data we use the same molecule for both fragments\n",
    "fragment_a = 'CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1'\n",
    "fragment_b = 'CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "infectious-title",
   "metadata": {},
   "source": [
    "## Child synthons\n",
    "Methods to find all child synthons of a molecule. The edges have a 'label' property that looks like this:\n",
    "\n",
    "`RING|[Xe]c1nncs1|[103Xe]C1CCCC1|RING|O=C(Cc1c[nH]c2ncccc12)N1CCN(C[Xe])CC1|OC(CC1CCC2CCCCC12)C1CCC(C[103Xe])CC1`\n",
    "\n",
    "This has six tokens.\n",
    "The second token describes what was added/removed.\n",
    "The fith token describes what it was added/removed to/from.\n",
    "Both use a Xe atom to mark the attachment site.\n",
    "Hence those two tokens can be considered potential *synthons*.\n",
    "They have to be filtered to remove molecules with 2 components and those with 2 attachements sites as those are\n",
    "not able to make simple adducts."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "unknown-interview",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_required_synthons(labels, synthon):\n",
    "    \"\"\"Only add synthons with a single attachment point and a single component\"\"\"\n",
    "    if '.' not in synthon and synthon.count('[Xe]') == 1:\n",
    "        labels.add(synthon)\n",
    "\n",
    "def find_synthons(tx, smiles):\n",
    "    \"\"\"Query for all child fragments (recursive).\n",
    "    Extract the label property of each edge and collect a set of SMILES that match our needs.\n",
    "    \"\"\"\n",
    "    labels = set()\n",
    "    for record in tx.run('MATCH (fa:F2 {smiles: $smiles})-[e:FRAG*]->(f:F2) RETURN e', smiles=smiles):\n",
    "        edges = record['e']\n",
    "        for edge in edges:\n",
    "            s = edge['label']\n",
    "            tokens = s.split('|')\n",
    "            add_required_synthons(labels, tokens[1])\n",
    "            add_required_synthons(labels, tokens[4])\n",
    "    return labels"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "filled-nurse",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Found 11 synthons\n",
      "[Xe]c1c[nH]c2ncccc12\n",
      "CN1CCN([Xe])CC1\n",
      "O=C(C[Xe])N1CCNCC1\n",
      "O=C([Xe])Cc1c[nH]c2ncccc12\n",
      "[Xe]N1CCNCC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN([Xe])CC1\n",
      "CC(=O)N1CCN([Xe])CC1\n",
      "CC(=O)[Xe]\n",
      "CN1CCN(C(=O)C[Xe])CC1\n",
      "O=CC[Xe]\n",
      "C[Xe]\n"
     ]
    }
   ],
   "source": [
    "# Generate synthons or fragment B\n",
    "with driver.session() as session:\n",
    "    synthons = session.read_transaction(find_synthons, fragment_b)\n",
    "    print('Found', len(synthons), 'synthons')\n",
    "    for s in synthons:\n",
    "        print(s)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "acoustic-bulgarian",
   "metadata": {},
   "source": [
    "## Expand fragment A"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "perfect-terry",
   "metadata": {},
   "outputs": [],
   "source": [
    "def find_expansions(tx, smiles, synthon):\n",
    "    \"\"\"Expand the molecules with this SMILES using this synthon\"\"\"\n",
    "    expansions = set()\n",
    "    for record in tx.run(\"MATCH (fa:F2 {smiles: $smiles})-[e1:FRAG*0..1]->(i1:F2)\"\n",
    "                         \"<-[e2:FRAG*0..1]-(i2)<-[e3:FRAG]-(c:Mol) \"\n",
    "                         \"WHERE split(e3.label, '|')[1] = $synthon RETURN c\", \n",
    "                         smiles=smiles, synthon=synthon):\n",
    "        node = record['c']\n",
    "        expansions.add(node['smiles'])\n",
    "    return expansions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "perceived-creator",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Found 23 expansions for [Xe]c1c[nH]c2ncccc12\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2ncccn2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(CC2CCOCC2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(CC2CCC2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2ccccn2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2csnn2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2ccccc2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2cscn2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2nncs2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2nccs2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2nc(=O)[nH][nH]2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(CC2CCCC2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(CC2CC2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2cnns2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2ccns2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2cccnc2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(CC2CCCCO2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(CC2CCCOC2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2ccsc2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(CC2CCOC2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2ccon2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2cncs2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(Cc2ccco2)CC1\n",
      "O=C(Cc1c[nH]c2ncccc12)N1CCN(CC2CCCCC2)CC1\n",
      "Found 0 expansions for CN1CCN([Xe])CC1\n",
      "Found 0 expansions for O=C(C[Xe])N1CCNCC1\n",
      "Found 0 expansions for O=C([Xe])Cc1c[nH]c2ncccc12\n",
      "Found 24 expansions for [Xe]N1CCNCC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2ccsc2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2ccccc2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2ccccn2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2nc3ccccc3[nH]2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2ccc3c(c2)OCCO3)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(CC2CCCO2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(CC2CCCCC2)CC1\n",
      "CN1CCN(C(=O)CN2CCNCC2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2nc3ccccc3s2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(CC2CC2)CC1\n",
      "CC(C)C1CN(C(=O)CN2CCNCC2)CCN1C\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2cccnc2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2ccncc2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2cscn2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(CC2CCOC2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(CC2CCOCC2)CC1\n",
      "CC(C)C1CN(C)CCN1C(=O)CN1CCNCC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2ccc3c(c2)CCO3)CC1\n",
      "CN1CCN(C(=O)CN2CCNCC2)C(c2ccccc2)C1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2cccs2)CC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2cn3ccccc3n2)CC1\n",
      "CN1CCN(C(=O)CN2CCNCC2)C(CO)C1\n",
      "CC(C)CC1CN(C)CCN1C(=O)CN1CCNCC1\n",
      "O=C(CN1CCNCC1)N1CCN(Cc2cccc3ccccc23)CC1\n",
      "Found 0 expansions for O=C(Cc1c[nH]c2ncccc12)N1CCN([Xe])CC1\n",
      "Found 0 expansions for CC(=O)N1CCN([Xe])CC1\n",
      "Found 9 expansions for CC(=O)[Xe]\n",
      "CC(=O)N1CCc2ccccc2C1CC(=O)N1CCN(C)CC1\n",
      "CC(=O)c1cc(CN2CCN(C(C)=O)CC2)on1\n",
      "CC(=O)c1ccc(CC(=O)N2CCN(C)CC2)cc1\n",
      "CC(=O)N1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)c1ccc(CN2CCN(C(C)=O)CC2)cc1\n",
      "CC(=O)N1CCN(CC(=O)N2CCN(C)CC2)CC1\n",
      "CC(=O)N1CCN(C(=O)Cc2c[nH]c3nccc(Cl)c23)CC1\n",
      "CC(=O)N1CCC(CN2CCN(C(C)=O)CC2)CC1\n",
      "CC(=O)c1cccc(CN2CCN(C(C)=O)CC2)c1\n",
      "Found 0 expansions for CN1CCN(C(=O)C[Xe])CC1\n",
      "Found 0 expansions for O=CC[Xe]\n",
      "Found 312 expansions for C[Xe]\n",
      "Cc1ccc2c(CC(=O)N3CCN(C)CC3)c[nH]c2c1\n",
      "CC(=O)N1CCN(Cc2nocc2C)CC1\n",
      "CC(=O)N1CCN(Cc2cc(=O)n3cc(C)sc3n2)CC1\n",
      "CC(=O)N1CCN(Cc2ccc3nc(C)ccc3c2)CC1\n",
      "Cc1cc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)on1\n",
      "Cc1[nH]c2ccnn2c(=O)c1CC(=O)N1CCN(C)CC1\n",
      "Cc1nnc(CC(=O)N2CCN(C)CC2)s1\n",
      "CC1CN(C(=O)Cc2c[nH]c3ncccc23)CCN1\n",
      "Cc1cc(CC(=O)N2CCN(C)CC2)n[nH]1\n",
      "CC(=O)N1CCN(Cc2snnc2C)CC1\n",
      "CC(=O)N1CCN(Cc2nc(C)n[nH]2)CC1\n",
      "CC(=O)N1CCN(CC2CC2C)CC1\n",
      "CC(=O)N1CCN(Cc2cccnc2C)CC1\n",
      "CN1CCN(C(=O)CC2CCN3CC2C=CCOc2ccccc2CN(C)CC3=O)CC1\n",
      "Cc1ncc(CC(=O)N2CCN(C)CC2)o1\n",
      "CC(=O)N1CCN(Cc2c3c(nn2C)CCCC3)CC1\n",
      "Cn1ccnc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(Cc2cc(=O)n3cccc(C)c3n2)CC1\n",
      "CC(=O)N1CCN(Cc2nnc(C)s2)CC1\n",
      "CC1(C)CN(C(=O)Cc2c[nH]c3ncccc23)CCO1\n",
      "CN1CCN(C(=O)CC2(C)CCS(=O)(=O)N2)CC1\n",
      "CC(=O)N1CCN(Cc2noc(C)n2)CC1\n",
      "CN1CCN(C(=O)Cc2c[nH]c3nccc(Cl)c23)CC1\n",
      "CC(=O)N1CCN(Cc2cc3ccccc3n(C)c2=O)CC1\n",
      "CC1CN(C(=O)Cc2c[nH]c3ncccc23)C(C)CO1\n",
      "CC(=O)N1CCN(Cn2ccn(C)c2=S)CC1\n",
      "CC1CCN(C)c2ccccc2N1C(=O)Cc1c[nH]c2ncccc12\n",
      "CC(=O)N1CCN(Cc2ccnn2C)CC1\n",
      "CC(=O)N1CCN(Cc2nn(C)c(=O)[nH]2)CC1\n",
      "CC(=O)N1CCN(CC2(C)CCNC2)CC1\n",
      "CC1CN(C(=O)Cc2ccccc2)CCN1C\n",
      "CC(=O)N1CCN(CC2CCCC(C)C2)CC1\n",
      "Cc1[nH]c(=O)[nH]c(=O)c1CC(=O)N1CCN(C)CC1\n",
      "Cn1ccc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)n1\n",
      "CC1CNCC1CC(=O)N1CCN(C)CC1\n",
      "CC(=O)N1CCN(Cc2cnc3ccc(C)cn23)CC1\n",
      "CN1CCN(C(=O)CC2(C)CC2)CC1\n",
      "CN1CCN(C(=O)Cc2nn(C)c(=O)c3ccccc23)CC1\n",
      "CC(=O)N1CCN(Cc2cnnn2C)CC1\n",
      "CC1CCCN(CC(=O)N2CCN(C)CC2)C1\n",
      "CC(=O)N1CCN(Cc2cnn(C)c2)CC1\n",
      "CC(=O)N1CCN(Cc2nn(C)c3ccccc23)CC1\n",
      "Cc1cccc2c(=O)n(CC(=O)N3CCN(C)CC3)cnc12\n",
      "CC(=O)N1CCN(Cc2cncn2C)CC1\n",
      "CC(=O)N1CCN(Cc2cn3c(C)cccc3n2)CC1\n",
      "CC1CCCCN1CC(=O)N1CCN(C)CC1\n",
      "Cn1cncc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(Cc2cnc3c(cnn3C)c2)CC1\n",
      "CN1CC2CN(C(=O)Cc3c[nH]c4ncccc34)CC2(C)C1\n",
      "CC(=O)N1CCN(Cc2cn(C)cn2)CC1\n",
      "Cc1ccnn1CC(=O)N1CCN(C)CC1\n",
      "CN1CCN(C(=O)Cc2cncn2C)CC1\n",
      "CC(=O)N1CCN(Cc2cc[nH]n2)C(C)C1\n",
      "Cc1ccc2c(CC(=O)N3CCN(C)CC3)coc2c1\n",
      "Cc1cccn2cc(CC(=O)N3CCN(C)CC3)nc12\n",
      "Cc1ccncc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(Cc2cc(C)nc3ccccc23)CC1\n",
      "CC(=O)N1CCN(Cc2cc3ccc(C)cc3[nH]2)CC1\n",
      "Cc1c(CC(=O)N2CCN(C)CC2)c(=O)oc2cc3oc4c(c3cc12)CCCC4\n",
      "CC(=O)N1CCN(Cc2nc(C)no2)CC1\n",
      "Cc1ccn(CC(=O)N2CCN(C)CC2)c(=O)c1\n",
      "Cc1sccc1CC(=O)N1CCN(C)CC1\n",
      "Cc1ccc2[nH]c3c(=O)n(CC(=O)N4CCN(C)CC4)ncc3c2c1\n",
      "CC(=O)N1CCN(Cc2cc3c(C)cccc3[nH]2)CC1\n",
      "CC(=O)N1CCN(Cc2ncnn2C)CC1\n",
      "Cc1ccc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)cc1\n",
      "CC(=O)N1CCN(Cc2ccco2)C(C)C1\n",
      "Cc1cccnc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(CC2(C)CCC2)CC1\n",
      "CC(=O)N1CCN(Cc2cnc3cccc(C)n23)CC1\n",
      "CC(=O)N1CCN(Cc2ccc3c(c2)CC(C)O3)CC1\n",
      "Cc1cncn1CC(=O)N1CCN(C)CC1\n",
      "CC(=O)N1CCN(Cc2cnccc2C)CC1\n",
      "CN1CCN(c2ccc(-c3ccnc4c3ccn4C)nn2)CC1\n",
      "CC(=O)N1CCN(Cc2cncc(C)c2)CC1\n",
      "Cc1ccc(CC(=O)N2CCN(C)CC2)cc1\n",
      "CC1CNCCN1C(=O)Cc1c[nH]c2ncccc12\n",
      "Cc1noc(C2CN(C(=O)Cc3c[nH]c4ncccc34)CCN2C)n1\n",
      "CN1CCCCC1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "Cc1oc2ccccc2c1CC(=O)N1CCN(C)CC1\n",
      "CN1CCN(C(=O)Cn2c(=O)n(C)c3ccccc32)CC1\n",
      "Cc1nnc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)o1\n",
      "Cc1csc2nc(CC(=O)N3CCN(C)CC3)cn12\n",
      "CC(=O)N1CCN(Cc2nnc3n(C)c(=O)c4ccccc4n23)CC1\n",
      "CC(=O)N1CCN(CC2(C)CCCC2)CC1\n",
      "CC(=O)N1CCN(Cc2c(C)nc3ccccn23)CC1\n",
      "CC(=O)N1CCN(Cc2nncn2C)CC1\n",
      "CC1CN(C(=O)CC2CCCCC2)CCN1C\n",
      "Cc1nc2ccccc2c(=O)n1CC(=O)N1CCN(C)CC1\n",
      "CC(=O)N1CCN(Cc2nccc(C)n2)CC1\n",
      "CC(=O)N1CCN(CC2(C)COC2)CC1\n",
      "CC(=O)N1CCN(Cc2nccn2C)CC1\n",
      "CC(=O)N1CCN(Cc2cc(C)co2)CC1\n",
      "Cc1cc(CC(=O)N2CCN(C)CC2)on1\n",
      "Cc1cccc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)c1\n",
      "Cc1cn2cc(CC(=O)N3CCN(C)CC3)nc2s1\n",
      "CC(=O)N1CCN(Cc2ccc(C)o2)CC1\n",
      "CC(=O)N1CCN(CC2(C)CCCNC2)CC1\n",
      "Cc1nn(CC(=O)N2CCN(C)CC2)c(=O)c2ccccc12\n",
      "CC(=O)N1CCN(Cc2nc(C)cs2)CC1\n",
      "CC(=O)N1CCN(Cc2cnc(C)o2)CC1\n",
      "Cc1cncc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)c1\n",
      "CC(=O)N1CCN(Cc2c3c(nn2C)CCSC3)CC1\n",
      "CC1CN(C(=O)Cn2cccn2)CCN1C\n",
      "Cc1[nH]cnc1CC(=O)N1CCN(C)CC1\n",
      "Cn1ncnc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(Cc2nnc(C)o2)CC1\n",
      "Cn1cc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)cn1\n",
      "Cc1ccc(CC(=O)N2CCN(C)CC2)cn1\n",
      "CC(=O)N1CCN(Cc2ccc(C)s2)CC1\n",
      "CN1CCN(C(=O)CN2C(=O)N(C)C3(CCCCC3)C2=O)CC1\n",
      "CC(=O)N1CCN(Cc2cc(C)nc3c2CCCC3)CC1\n",
      "CC1CN(Cc2cccnc2)CCN1C(=O)Cc1c[nH]c2ncccc12\n",
      "CC1CCN(CC(=O)N2CCN(C)CC2)CC1\n",
      "CC(=O)N1CCN(Cc2nc3c(cnn3C)c(=O)[nH]2)CC1\n",
      "CC(=O)N1CCN(Cc2cc(C)on2)CC1\n",
      "Cc1nnc(CC(=O)N2CCN(C)CC2)o1\n",
      "Cc1nn(CC(=O)N2CCN(C)CC2)c2ncccc12\n",
      "CC(=O)N1CCN(Cc2cnc3ccc(C)cc3c2)CC1\n",
      "CC(=O)N1CCN(Cc2cc(C)c3ncccc3c2)CC1\n",
      "CC1CN(C(=O)Cc2cccs2)CCN1C\n",
      "Cc1oncc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "Cc1cccc2c(CC(=O)N3CCN(C)CC3)c[nH]c12\n",
      "Cc1cnc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)o1\n",
      "CC(=O)N1CCN(Cc2conc2C)CC1\n",
      "Cc1conc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(CC2C(=O)OC3CC4(C)CCCC5(CO5)C4CC32)CC1\n",
      "CC1CN(C(=O)CN2CCCC2)CCN1C\n",
      "CC(=O)N1CCN(Cc2csc(C)c2)CC1\n",
      "CC(=O)N1CCN(Cc2cc3ccccc3n2C)CC1\n",
      "CN1CCN(C(=O)Cn2c3ccccc3c3cnn(C)c(=O)c32)CC1\n",
      "CN1CCN(CC(=O)N2CCN(C)CC2)CC1\n",
      "Cn1nncc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(CC2CCOC2C)CC1\n",
      "Cc1n[nH]c(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)n1\n",
      "Cc1cnc2c(cnn2CC(=O)N2CCN(C)CC2)c1\n",
      "CC(=O)N1CCN(Cc2ccnc(C)n2)CC1\n",
      "CC(=O)N1CCN(CC2CCOC(C)C2)CC1\n",
      "Cc1ccc(CC(=O)N2CCN(C)CC2)s1\n",
      "CC(=O)N1CCN(Cc2cccc(C)c2)CC1\n",
      "CC1CN(C)CCN1C(=O)Cc1nc2ncccn2n1\n",
      "CN1CCN(C(=O)Cc2cnnn2C)CC1\n",
      "Cc1ncc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)o1\n",
      "CC(=O)N1CCN(Cc2ccoc2C)CC1\n",
      "Cn1nnnc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(CC2(C)CC2)CC1\n",
      "Cc1ccc2c(c1)N(C(=O)Cc1c[nH]c3ncccc13)CC(C)O2\n",
      "CC(=O)N1CCN(Cc2ccc3c(c2)ncn3C)CC1\n",
      "CC(=O)N1CCN(CC2CCC(C)CC2)CC1\n",
      "CC1CCC(CC(=O)N2CCN(C)CC2)C1\n",
      "CC(=O)N1CCN(Cc2sccc2C)CC1\n",
      "CC(=O)N1CCN(Cc2ccn(C)c(=O)c2)CC1\n",
      "CC(=O)N1CCN(Cc2cccc(C)n2)CC1\n",
      "CC(=O)N1CCN(Cc2cn(C)nn2)CC1\n",
      "CC(=O)N1CCN(Cc2ncc(C)s2)CC1\n",
      "CC(=O)N1CCN(Cc2cnoc2C)CC1\n",
      "CC(=O)N1CCN(Cc2cc(=O)n3cc(C)ccc3n2)CC1\n",
      "CC(=O)N1CCN(Cc2cc(C)ccn2)CC1\n",
      "Cc1cc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)no1\n",
      "CN1CCN(C(=O)Cn2cnc3c(cnn3C)c2=O)CC1\n",
      "Cc1ncccc1CC(=O)N1CCN(C)CC1\n",
      "CC1OCCN(C(=O)Cc2c[nH]c3ncccc23)C1C\n",
      "Cc1c(CC(=O)N2CCN(C)CC2)c(=O)oc2cc3c(cc12)CCC1(CCCCC1)O3\n",
      "CC1CN(Cc2ccccc2)CCN1C(=O)Cc1c[nH]c2ncccc12\n",
      "CN1CCN(C(=O)NCCc2cn(C)c3ncccc23)CC1\n",
      "CC(=O)N1CCN(Cc2ocnc2C)CC1\n",
      "CC(=O)N1CCN(Cc2coc3ccc(C)cc3c2=O)CC1\n",
      "CN1CCN(C(=O)CC2CCN(C)C2)CC1\n",
      "CC(=O)N1CCN(Cn2ncn(C)c2=S)CC1\n",
      "CC(=O)N1CCN(Cc2ncc(C)o2)CC1\n",
      "CC(=O)N1CCN(Cc2c(C)ccc3ccccc23)CC1\n",
      "CC(=O)N1CCN(Cc2nc(C)c[nH]2)CC1\n",
      "CN1CCN(C(=O)CN2CCC3(CCC(=O)N(C)C3)CC2)CC1\n",
      "CN1CCN(C(=O)Cn2ncn(C)c2=O)CC1\n",
      "CC(=O)N1CCN(Cc2nnc3n(C)c(=O)c4sccc4n23)CC1\n",
      "CC(=O)N1CCN(Cc2c(C)oc3ccccc23)CC1\n",
      "CC(=O)N1CCN(Cc2ccnc(C)c2)CC1\n",
      "Cn1cc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)nn1\n",
      "CC(=O)N1CCN(Cc2ccsc2C)CC1\n",
      "CC1CN(C)CCN1C(=O)Cn1ccc(=O)c2ccccc21\n",
      "CN1CCN(C(=O)CC2(C)COC2)CC1\n",
      "CC(=O)N1CCN(Cc2nc3ccccc3c(=O)n2C)CC1\n",
      "COCCn1cc(CC(=O)N2CCN(C)CC2)c2cccnc21\n",
      "Cc1cnccc1CC(=O)N1CCN(C)CC1\n",
      "CC(=O)N1CCN(CC2CCN(C)CC2)CC1\n",
      "Cc1ccn(CC(=O)N2CCN(C)CC2)n1\n",
      "CC(=O)N1CCN(Cc2nc3sc4c(c3c(=O)[nH]2)CCC(C)C4)CC1\n",
      "CC(=O)N1CCN(Cc2ccc3oc(=O)n(C)c3c2)CC1\n",
      "CC(=O)N1CCN(Cc2nn3c(=O)cc(C)nc3s2)CC1\n",
      "CC1CCCCC1CC(=O)N1CCN(C)CC1\n",
      "CC(=O)N1CCN(Cc2ccc(C)nc2)CC1\n",
      "Cn1cnnc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC1CN(C)CCN1C(=O)Cc1ccc2c(c1)CCO2\n",
      "CC(=O)N1CCN(Cc2cnc(C)cn2)CC1\n",
      "CC1CC(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)C1\n",
      "CN1CCN(C(=O)CN2CCN(C)C(=O)C2)CC1\n",
      "Cc1ccccc1CC(=O)N1CCN(C)CC1\n",
      "CC(=O)N1CCN(Cc2ccn(C)n2)CC1\n",
      "CC(=O)N1CCN(Cc2ccc(C)cn2)CC1\n",
      "CC(=O)N1CCN(Cc2cc(C)no2)CC1\n",
      "CC(=O)N1CCN(Cc2cn3cccc(C)c3n2)CC1\n",
      "CN1CCN(C(=O)CC2(C)CCCCC2)CC1\n",
      "Cc1ccncc1CC(=O)N1CCN(C)CC1\n",
      "Cc1cc2scc(CC(=O)N3CCN(C)CC3)c2s1\n",
      "CC(=O)N1CCN(Cc2nc3ccccc3n2C)CC1\n",
      "Cc1nccn1CC(=O)N1CCN(C)CC1\n",
      "Cc1cccc2[nH]cc(CC(=O)N3CCN(C)CC3)c12\n",
      "CC(=O)N1CCN(Cc2cc(=O)n3c(C)csc3n2)CC1\n",
      "CC(=O)N1CCN(Cc2ccc3c(c2)sc(=O)n3C)CC1\n",
      "Cc1cn(CC(=O)N2CCN(C)CC2)c2ccccc12\n",
      "CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1(C)C\n",
      "CC(=O)N1CCN(Cc2ccc3c(c2)oc(=O)n3C)CC1\n",
      "CC(=O)N1CCN(Cc2c3c(nn2C)CCOC3)CC1\n",
      "CN1CCN(C(=O)CN2C(=O)c3ccccc3N3C(=O)CCC23C)CC1\n",
      "Cc1cc(CC(=O)N2CCN(C)CC2)no1\n",
      "CC(=O)N1CCN(Cc2scnc2C)CC1\n",
      "CC(=O)N1CCN(CC2CNCC2C)CC1\n",
      "Cc1ncoc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(CC2(C)CCCCO2)CC1\n",
      "C=C1CCCC2(C)CC3OC(=O)C(CN4CCN(C(C)=O)CC4)C3CC12\n",
      "CC1CCC(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)O1\n",
      "CC(=O)N1CCN(Cc2cc(C)ncn2)CC1\n",
      "CC(=O)N1CCN(CC2(C)CCCS2)CC1\n",
      "CC(=O)N1CCN(Cc2occc2C)CC1\n",
      "CC(=O)N1CCN(Cc2ccc(C)nn2)CC1\n",
      "CC(=O)N1CCN(Cc2nccnc2C)CC1\n",
      "CC(=O)N1CCN(Cc2csc(C)n2)CC1\n",
      "CN1CCN(C(=O)Cc2ccn(C)n2)CC1\n",
      "Cc1ccnc(N2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)n1\n",
      "CC(=O)N1CCN(Cc2nc3ccccc3nc2C)CC1\n",
      "CC(=O)N1CCN(Cc2cnc3c(C)cccn23)CC1\n",
      "CC(=O)N1CCN(Cc2ccncc2)C(C)C1\n",
      "CC(=O)N1CCN(Cc2ccncc2C)CC1\n",
      "CC(=O)N1CCN(Cc2ncccc2C)CC1\n",
      "CC1CN(CC(=O)N2CCN(C)CC2)c2ccccc2S1\n",
      "CC1CCCC1CC(=O)N1CCN(C)CC1\n",
      "CC(=O)N1CCN(Cc2cnc(C)s2)CC1\n",
      "CC(=O)N1CCN(Cc2nc3cc(C)ccc3s2)CC1\n",
      "CN1CCC(N2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)C1=O\n",
      "Cc1cc(N2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)ncn1\n",
      "Cc1cnc(CC(=O)N2CCN(C)CC2)s1\n",
      "CC1CN(C)CCN1C(=O)Cn1[nH]c(=O)c2ccccc2c1=O\n",
      "Cc1noc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)n1\n",
      "CC1CN(C)CCN1C(=O)CN1CCc2ccccc21\n",
      "CC(=O)N1CCN(Cc2coc(C)n2)CC1\n",
      "CN1CCN(C(=O)CC2(C)CCCC2)CC1\n",
      "Cc1nc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)co1\n",
      "Cc1nocc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(Cc2ccccc2)C(C)C1\n",
      "Cn1nnc(CN2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)n1\n",
      "Cc1cccc(CC(=O)N2CCN(C)CC2)c1\n",
      "CC1CN(C(=O)CC2CCCC2)CCN1C\n",
      "Cc1nc2ccccc2n1CC(=O)N1CCN(C)CC1\n",
      "Cc1ccoc1CC(=O)N1CCN(C)CC1\n",
      "CC1CCCN(CC(=O)N2CCN(C)CC2)CC1\n",
      "CN1CCN(C(=O)CC2CCC(=O)N2C)CC1\n",
      "CC(=O)N1CCN(Cc2c3c(nn2C)CCC3)CC1\n",
      "CC(=O)N1CCN(Cc2ccccc2C)CC1\n",
      "CC(=O)N1CCN(Cc2cc(C)n[nH]2)CC1\n",
      "CN1CCN(C(=O)Cn2c3c(c4ccccc42)CCN2C(=O)c4ccccc4N(C)C32)CC1\n",
      "CN1CCC(CC(=O)N2CCN(C)CC2)CC1\n",
      "CN1CCN(C(=O)Cc2cnn(C)c2)CC1\n",
      "CC(=O)N1CCN(Cc2c[nH]nc2C)CC1\n",
      "CC1CCCC(CC(=O)N2CCN(C)CC2)C1\n",
      "CC(=O)N1CCN(Cc2ccc3c(c2)CCC(=O)N3C)CC1\n",
      "Cc1ncccc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "Cc1cc2c(CC(=O)N3CCN(C)CC3)csc2s1\n",
      "CC(=O)N1CCN(Cc2cc(C)ns2)CC1\n",
      "CN1CCN(C(=O)Cn2ccc(=O)n(C)c2=O)CC1\n",
      "Cc1cnc2n(c1=O)C(CC(=O)N1CCN(C)CC1)CS2\n",
      "CN1CCN(C(=O)Cc2nn(C)c3ccccc23)CC1\n",
      "CC(=O)N1CCN(Cc2nc(C)c3ccccc3n2)CC1\n",
      "CN1CCN(C(=O)Cc2cn(C)c3ccccc23)CC1\n",
      "Cc1ccc2occ(CC(=O)N3CCN(C)CC3)c2c1\n",
      "CC(=O)N1CCN(CC2CCCCC2C)CC1\n",
      "Cn1ccc2c(-c3ccccc3CN3CCNCC3)ccnc21\n",
      "CC(=O)N1CCN(Cc2cc(=O)n3nc(C)sc3n2)CC1\n",
      "CN1CCN(C(=O)Cc2ccnn2C)CC1\n",
      "CC(=O)N1CCN(Cc2c(C)[nH]c(=O)[nH]c2=O)CC1\n",
      "CC1CN(C)CCN1C(=O)Cc1n[nH]c2ccccc12\n",
      "CC(=O)N1CCN(Cc2cn3cc(C)ccc3n2)CC1\n",
      "CC(=O)N1CCN(Cc2cnc3onc(C)c3c2)CC1\n",
      "CC(=O)N1CCN(CC2CCC(C)O2)CC1\n",
      "CC(=O)N1CCN(Cc2cccn2C)CC1\n",
      "CC1C(=O)CCC1CC(=O)N1CCN(C)CC1\n",
      "Cc1nc(CC(=O)N2CCN(C)CC2)cs1\n",
      "Cc1nsc(N2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)n1\n",
      "Cn1nccc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "CC(=O)N1CCN(Cc2ccc3c(c2)nnn3C)CC1\n",
      "Cc1cc(=O)n2c(n1)SCC2CC(=O)N1CCN(C)CC1\n",
      "CC(=O)N1CCN(Cc2n[nH]cc2C)CC1\n",
      "CC(=O)N1CCN(Cc2ncc(C)cn2)CC1\n",
      "CC(=O)N1CCN(CC2CCCN2C)CC1\n",
      "CC(=O)N1CCN(Cc2nc3c(s2)CC(C)CC3)CC1\n",
      "CC1CN(CC(=O)N2CCN(C)CC2)CCO1\n",
      "CC1Oc2ccccc2N(CC(=O)N2CCN(C)CC2)C1=O\n",
      "Cc1cc2ccccc2n1CC(=O)N1CCN(C)CC1\n",
      "Cc1ccccc1CN1CCN(C(=O)Cc2c[nH]c3ncccc23)CC1\n",
      "Cc1ccc(N2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)nn1\n",
      "CC(=O)N1CCN(Cc2nnnn2C)CC1\n",
      "CC(=O)N1CCN(Cc2ccc3nc(C)sc3c2)CC1\n",
      "CC(=O)N1CCN(Cc2ccn(C)c2)CC1\n",
      "Cc1n[nH]c(CC(=O)N2CCN(C)CC2)n1\n",
      "Cc1ccc(CC(=O)N2CCN(C)CC2)o1\n",
      "CC(=O)N1CCN(CC2CC(C)C2)CC1\n",
      "CC(=O)N1CCN(Cc2nnn(C)n2)CC1\n",
      "CC(=O)N1CCN(Cc2cccc3[nH]ccc23)C(C)C1\n",
      "CC1CN(C)CCN1C(=O)Cn1nnc2ccccc21\n",
      "CC(=O)N1CCN(Cc2cnc(C)nc2)CC1\n",
      "Cc1nccc(N2CCN(C(=O)Cc3c[nH]c4ncccc34)CC2)n1\n",
      "CC(=O)N1CCN(Cc2ccc(C)cc2)CC1\n",
      "Cc1cnn(CC(=O)N2CCN(C)CC2)c1\n",
      "368 total expansions from 4 out of 11 synthons\n"
     ]
    }
   ],
   "source": [
    "# do the expansions\n",
    "\n",
    "with driver.session() as session:\n",
    "    count = 0\n",
    "    expanded_synthons = 0\n",
    "    # for each synthon\n",
    "    for synthon in synthons:\n",
    "        # do the expansion of fragment_a with that synthon\n",
    "        expansions = session.read_transaction(find_expansions, fragment_a, synthon)\n",
    "        print('Found', len(expansions), 'expansions for', synthon)\n",
    "        count += len(expansions)\n",
    "        if (len(expansions)):\n",
    "            expanded_synthons += 1\n",
    "        for e in expansions:\n",
    "            print(e)\n",
    "    print(count, 'total expansions from', expanded_synthons, 'out of', len(synthons), 'synthons')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "vocal-ghost",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "suited-comparative",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
